[general]
enname=German
name=Deutsch
[translations]
Error=Fehler
The_template_files_could_not_be_loaded._Without_them_Base_Frame_does_not_work!=Die temporären Dateien konnten nicht geladen werden. Wenn sie fehlen, funktioniert Base Frame nicht!
Sourcecode=Quellcode
Application_name=Programmname
Abbreviation=Abkürzung
Long_name=Langer Name
Installation_folder=Installationsordner
Author=Autor
Email=Email
Application_version=Programmversion
Update_Version=Update Version
Update_comparison=Update Abgleich
Advanced=Fortgeschritten
Associated_files=Dazugehörige Dateien
Files=Dateien
Folders=Ordner
Exe=Exe
Content=Inhalt
None=Keine
Compile_scripts=Skripte kompilieren
Remove_Entry=Eintrag entfernen
Choose_icon=Icon wählen
Generate_installation_file=Installationsdatei generieren
Keep_temporary_files=Temporäre Dateien behalten
Close=Schließen
Default_values=Standardwerte
Language=Sprache
Help=Hilfe
About=Über
Settings=Einstellungen
Attention=Achtung
When_you_change_the_language,_Base_Frame_needs_to_be_restarted._All_settings_will_be_lost=Wenn du die Sprache änderst, muss Base Frame neugestartet werden. Alle Einstellungen gehen verloren!
The_File_may_be_opened=Die Datei könnte geöffnet sein
Creating_folder_%1%=Erstelle Ordner %1%
Folder_%1%_could_not_be_created=Ordner %1% konnte nicht erstellt werden
Extracting_file_%1%=Extrahiere Datei %1%
File_%1%_could_not_be_extracted=Datei %1% konnte nicht extrahiert werden
Details=Details
Installation_started=Installation gestartet
Installer=Installer
In_progress=Läuft
Compile_%1%=Kompiliere %1%
The_compiler_needs_very_long_to_compile_%1%.=Der Kompiler benötigt sehr lange um %1% zu kompilieren
Compile_the_installation_file=Kompiliere Installationsdatei
Finished=Beendet
Base_Frame_was_appended_to_%1%.=%1% wurde mit dem Grundgerüst versehen.
Do_you_want_to_create_a_shortcut_for_faster_compilation?=Möchtest du eine Verknüpfung zum schnellen Kompilieren erstellen?
Compile_with_Base_Frame=Kompiliere mit Grundgerüst
Enter_the_default_values_for_new_projects=Gib die Standardwerte für neue Projekte ein
OK=OK
Cancel=Abbrechen
Set_default_values=Standardwerte setzen
Update_URL=Update Link
Changelog=Changelog
Add_entry=Eintrag hinzufügen
Advanced_informations=Fortgeschrittene Informationen
New_sourcecode=Neuer Quellcode
You_are_about_to_open_a_new_sourcecode_of_another_Application.=Du bist dabei, neuen Quellcode zu öffnen.
All_your_current_settings_of_currently_opened_application_will_be_lost.=Alle geänderten Einstellungen vom aktuell geöffneten Programm werden verloren gehen.
Base_Frame_needs_to_be_restarted.=Grundgerüst muss neugestartet werden
Do_you_want_to_continue?=Willst du fortfahren?
Select_sourcecode=Wähle Quellcode
AutoHotKey_scripts=AutoHotKey Skripte
Please_choose_an_AutoHotKey_script=Bitte wähle ein AutoHotKey Skript
Select_file_to_add=Wähle Datei zum Hinzufügen
The_files_must_be_inside_the_path_of_the_sourcecode=Die Dateien müssen innerhalb des Pfads vom Quellcode sein
Information=Information
The_sourcecode_script_cannot_be_added_to_the_selection=Der Quellcode Skript kann nicht zur Auswahl hinzugefügt werden
The_file_%1%_could_not_be_added_because_it_is_the_sourcecode_script=Die Datei %1% konnte nicht hinzugefügt werden, weil es der Quellcode Skript ist
The_file_%1%_could_not_be_added_because_it_is_the_Default_Licence_file_of_the_installer=Die Datei %1% konnte nicht hinzugefügt werden, weil es die standardmäßige Lizenzdatei des Installers ist
Select_a_folder_to_add=Wähle Ordner zum Hinzufügen
The_folder_must_be_a_subfolder_of_the_sourcecode_path=Der Ordner muss ein Unterordner des Quellcode Pfads sein
Add_Scripts_that_should_compile=Alle Skripte, die kompiliert werden sollen
The_files_must_be_inside_the_folder_of_the_sourcecode_or_a_subfolder=Die Dateien müssen innerhalb des Ordners des Quellcodes oder ein Unterordner davon sein
Choose_icon_file_for_the_script_%1%=Wähle eine Icon Datei für den Skript %1%
Icons=Icons
All_files_that_are_inside_this_folder_will_also_be_removed_from_the_selection=Alle Dateien, welche inerhalb des Ordners sind, werden auch von der Auswahl entfernt
The_file_belongs_to_Base_Frame_and_cannot_be_removed=Die Datei gehört zu Grundgerüst und kann nicht entfernt werden
No_icon=Kein Icon
Icon=Icon
Delete_icon=Icon löschen
Select_icon=Icon wählen
No_help_file_was_found=Hilfe Datei nicht gefunden
Do_you_agree_the_license_terms?=Stimmst du den Lizenzbedingungen zu?
Yes,_I_agree=Ja, ich stimme zu
No=Nein
Show_license=Lizenz zeigen
License_terms=Lizenzbedingungen
This_installer_installs_%1%_in_the_folder_%2%.=Der Installer installiert %1% im Ornder %2%
If_you_already_use_%1%_and_you_want_to_update_your_version,_then_move_the_installer_into_tha_folder_of_%1%_and_run_it_again.=Wenn du bereits %1% benutzt und deine Version aktualisieren möchtest, dann verschiebe den Installer in den Ordner von %1% und starte es nochmal.
If_you_want_to_install_%1%_the_first_time,_then_click_on_OK.=Wenn du %1% das erste mal installierst, dann klicke auf OK
This_installer_will_update_%1%_to_the_version_%2%.=Der Installer wird %1% auf die Version %2% aktualisieren
Click_on_OK_to_continue.=Klicke auf OK um fortzufahren.
Installation_successfull!=Installation erfolgreich!
If_Windows_notifies_you_that_the_application_was_not_installed_properly,_ignore_it.=Falls Windows dich benachrichtigt, dass das Programm nicht korrekt installiert wurde, ignoriere es.
Update_Checker_for_%1%=Update Checker für %1%
Downloading_the_update_informations=Lade die Update Informationen herunter
An_error_occured_while_getting_the_update_informations=Ein Fehler trat beim Holen der Update Informationen auf
Maybe_you_don't_have_internet_connetion_or_the_link_that_is_stored_in_the_application_is_corrupt=Vielleicht hast du keine Internetverbindung oder der Link, der im Programm gespeichert ist, ist korrupt
There_might_be_an_update_available_anyway=Es könnte dennoch ein Update verfügbar sein
A_new_version_is_avialable!=Eine neue Version ist verfügbar!
Do_you_want_to_download_it?=Willst du es herunterladen?
Installed_version=Installierte Version
Available_version=Verfügbare Version
Downloading_new_version=Lade neue Version herunter
Download_successfull!=Download erfolgreich!
Starting_installation=Starte Installation
Download_failed=Download fehlgeschlagen
Open_webpage=Öffne Webseite
Maybe_you_should_try_it_later=Vielleicht solltest du es später versuchen
The_update_information_does_not_contain_informations_about_where_to_get_the_new_version.=Die Update Informationen enthalten keine Hinweise darauf, wo sich die neue Version befindet.
Download_of_the_update_is_not_possible=Download des Updates ist nicht möglich
No_new_version_available.=Keine neue Version verfügbar
Current_version=Aktuelle Version
Open=Öffnen
Base_Frame=Grundgerüst
